"""Категории документов"""

DOCUMENT_CATEGORIES = {
    "гоичс": {
        "name": "ГОиЧС",
        "subcategories": ["Инструкции", "Лекции"],
    },
    "охрана_труда": {
        "name": "Охрана труда",
        "subcategories": [
            "Инструкции",
            "Нормативная документация",
            "Положения",
            "Программа обучения",
        ],
    },
    "электробезопасность": {
        "name": "Электробезопасность",
        "subcategories": {
            "админ_тех_перс": {
                "name": "Административно-технический персонал",
                "subcategories": ["Билеты", "Тесты"],
            },
            "неэлектр_перс": {
                "name": "Неэлектрический персонал",
                "subcategories": ["Общие документы"],
            },
            "нормативка": {
                "name": "Нормативная документация",
                "subcategories": ["Инструкции", "Первая помощь", "ПУЭ"],
            },
        },
    },
    "пожар_безопасность": {
        "name": "Пожарная безопасность",
        "subcategories": ["Документы", "Материалы"],
    },
}
